# Task 1 -----------------------------------------------

# s = [63, 100, 91, 20, 0, 97, 7, 69, 23, 69, 21, 71, 70, 42, 55, 77, 46, 96, 33, 37]
# print(sum(s))

# Task 2 --------------------------------------------------

# a = [21, 88, 0, 29, 77, 82, 46, 74, 82, 34]
# a.sort(reverse=True)
# print(a)

# Task 3 --------------------------------------------------

a = [int(input('-> ')) for i in range(int(input('Введите количество элементов: ')))]
k = int(input("Введите элемент: "))
a.remove(k)
print(a)






