import re

p = r'^\+7\s\d{3}\s\d{3}-\d{2}-\d{2}$'
phone_number = '+7 499 456-45-78'

if re.match(p, phone_number):
    print('Номер телефона валидный')
else:
    print('Номер телефона невалидный')

#--------------------------------------------------
p = r'^\+7\s\d{3}\s\d{3}-\d{2}-\d{2}$'
phone_number = '+74994564578'

if re.match(p, phone_number):
    print('Номер телефона валидный')
else:
    print('Номер телефона невалидный')
#--------------------------------------------------
p = r'^7\s\(\d{3}\)\s\d{3}\s\d{2}\s\d{2}$'
phone_number = '7 (499) 456 45 78'

if re.match(p, phone_number):
    print('Номер телефона валидный')
else:
    print('Номер телефона невалидный')

#--------------------------------------------------
p = r'^7\s\(\d{3}\)\s\d{3}-\d{2}-\d{2}$'
phone_number = '7 (499) 456-45-78'

if re.match(p, phone_number):
    print('Номер телефона валидный')
else:
    print('Номер телефона невалидный')